In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('apples.csv')
df1.head()

     Name  Sales
0    Zack    0.0
1   Weezy   44.0
2   Drake   10.0
3  Yeezus  808.0
4    Zack    2.5

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
Name     8 non-null object
Sales    8 non-null float64
dtypes: float64(1), object(1)
memory usage: 208.0+ bytes

In [4]:
df1.describe().T

       count      mean         std  min    25%   50%   75%    max
Sales    8.0  135.4375  279.882812  0.0  7.375  10.0  83.0  808.0

In [11]:
# merging duplicate rows
df2 = df1.groupby(['Name']).sum()
df2

         Sales
Name
Drake     20.0
Weezy     53.0
Yeezus  1008.0
Zack       2.5

In [12]:
# sales were inflated by 12%
df2['Adjusted'] = df2.Sales / 1.12
df2

         Sales    Adjusted
Name
Drake     20.0   17.857143
Weezy     53.0   47.321429
Yeezus  1008.0  900.000000
Zack       2.5    2.232143

In [13]:
# total sales
df2.Adjusted.sum()

967.4107142857142

In [14]:
# best and worst sales
df2.sort_values(by='Adjusted').iloc[[0, -1]]

         Sales    Adjusted
Name
Zack       2.5    2.232143
Yeezus  1008.0  900.000000